cask_args appdir: "/Applications"

brew "mas"

mas "amphetamine", id:937984704
mas "bookmarker for pinboard", id:1451400394
mas "dark-mode-for-safari", id:1397180934
mas "drafts", id:1435957248
mas "ipulse", id:1028916583
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "pcalc", id:403504866
mas "StopTheMadness", id: 1376402589
mas "Soulver 2", id: 413965349
mas "wipr", id:1320666476
mas "xcode", id:497799835

cask "1password"
cask "aerial"
cask "apptrap"
cask "bbedit"
cask "bettertouchtool"
cask "coconutbattery"
cask "firefox"
cask "handbrake"
cask "iterm2"
cask "karabiner-elements"
cask "mactex"
cask "makemkv"
cask "netnewswire"
cask "safari-technology-preview"
cask "slimbatterymonitor"
cask "the-unarchiver"
cask "transmission"
cask "twitterrific"
cask "vlc"
cask "xact"

brew "bash"
brew "cloc"
brew "coreutils"
ALL_FFMPEG_OPTIONS = `brew options ffmpeg | grep -vE '\s' | grep -- '--with-'`.gsub("--", "").split("\n")
brew "ffmpeg", args: ALL_FFMPEG_OPTIONS
brew "fortune"
brew "git"
brew "gti"
brew "nmap"
brew "python"
brew "reattach-to-user-namespace"
brew "sl"
brew "ssh-copy-id"
brew "stow"
brew "streamlink"
brew "thefuck"
brew "tmux"
brew "todo-txt"
brew "tree"
brew "vim"
brew "wget"
brew "youtube-dl"

